#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AK103_Zenitco

#include "Basic.hpp"

#include "BP_AK_Master_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AK103_Zenitco.BP_AK103_Zenitco_C
// 0x0080 (0x0628 - 0x05A8)
class ABP_AK103_Zenitco_C final : public ABP_AK_Master_C
{
public:
	class UStaticMeshComponent*                   S_Chargehandle_RP1;                                // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Dustcover;                                         // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Handguard;                                         // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Muzzle;                                            // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Stock;                                             // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGBRailComponent*                       BottomRail02;                                      // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGBRailComponent*                       BottomRail01;                                      // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGBRailComponent*                       RightRail01;                                       // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGBRailComponent*                       LeftRail02;                                        // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGBRailComponent*                       LeftRail01;                                        // 0x05F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGBRailComponent*                       TopRail02;                                         // 0x05F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGBRailComponent*                       TopRail01;                                         // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGBRailComponent*                       RearSightRail;                                     // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Barrel;                                         // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGBFrontSightPostComponent*             FrontSightPost;                                    // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGBSightComponent*                      IronSight;                                         // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AK103_Zenitco_C">();
	}
	static class ABP_AK103_Zenitco_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AK103_Zenitco_C>();
	}
};
static_assert(alignof(ABP_AK103_Zenitco_C) == 0x000008, "Wrong alignment on ABP_AK103_Zenitco_C");
static_assert(sizeof(ABP_AK103_Zenitco_C) == 0x000628, "Wrong size on ABP_AK103_Zenitco_C");
static_assert(offsetof(ABP_AK103_Zenitco_C, S_Chargehandle_RP1) == 0x0005A8, "Member 'ABP_AK103_Zenitco_C::S_Chargehandle_RP1' has a wrong offset!");
static_assert(offsetof(ABP_AK103_Zenitco_C, Dustcover) == 0x0005B0, "Member 'ABP_AK103_Zenitco_C::Dustcover' has a wrong offset!");
static_assert(offsetof(ABP_AK103_Zenitco_C, Handguard) == 0x0005B8, "Member 'ABP_AK103_Zenitco_C::Handguard' has a wrong offset!");
static_assert(offsetof(ABP_AK103_Zenitco_C, Muzzle) == 0x0005C0, "Member 'ABP_AK103_Zenitco_C::Muzzle' has a wrong offset!");
static_assert(offsetof(ABP_AK103_Zenitco_C, Stock) == 0x0005C8, "Member 'ABP_AK103_Zenitco_C::Stock' has a wrong offset!");
static_assert(offsetof(ABP_AK103_Zenitco_C, BottomRail02) == 0x0005D0, "Member 'ABP_AK103_Zenitco_C::BottomRail02' has a wrong offset!");
static_assert(offsetof(ABP_AK103_Zenitco_C, BottomRail01) == 0x0005D8, "Member 'ABP_AK103_Zenitco_C::BottomRail01' has a wrong offset!");
static_assert(offsetof(ABP_AK103_Zenitco_C, RightRail01) == 0x0005E0, "Member 'ABP_AK103_Zenitco_C::RightRail01' has a wrong offset!");
static_assert(offsetof(ABP_AK103_Zenitco_C, LeftRail02) == 0x0005E8, "Member 'ABP_AK103_Zenitco_C::LeftRail02' has a wrong offset!");
static_assert(offsetof(ABP_AK103_Zenitco_C, LeftRail01) == 0x0005F0, "Member 'ABP_AK103_Zenitco_C::LeftRail01' has a wrong offset!");
static_assert(offsetof(ABP_AK103_Zenitco_C, TopRail02) == 0x0005F8, "Member 'ABP_AK103_Zenitco_C::TopRail02' has a wrong offset!");
static_assert(offsetof(ABP_AK103_Zenitco_C, TopRail01) == 0x000600, "Member 'ABP_AK103_Zenitco_C::TopRail01' has a wrong offset!");
static_assert(offsetof(ABP_AK103_Zenitco_C, RearSightRail) == 0x000608, "Member 'ABP_AK103_Zenitco_C::RearSightRail' has a wrong offset!");
static_assert(offsetof(ABP_AK103_Zenitco_C, SK_Barrel) == 0x000610, "Member 'ABP_AK103_Zenitco_C::SK_Barrel' has a wrong offset!");
static_assert(offsetof(ABP_AK103_Zenitco_C, FrontSightPost) == 0x000618, "Member 'ABP_AK103_Zenitco_C::FrontSightPost' has a wrong offset!");
static_assert(offsetof(ABP_AK103_Zenitco_C, IronSight) == 0x000620, "Member 'ABP_AK103_Zenitco_C::IronSight' has a wrong offset!");

}

