#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FNFAL

#include "Basic.hpp"

#include "BP_FAL_Master_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FNFAL.BP_FNFAL_C
// 0x0018 (0x05C0 - 0x05A8)
class ABP_FNFAL_C final : public ABP_FAL_Master_C
{
public:
	class UGBRailComponent*                       TopRail;                                           // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGBSightComponent*                      IronSight;                                         // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGBFrontSightPostComponent*             FrontSightPost;                                    // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FNFAL_C">();
	}
	static class ABP_FNFAL_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FNFAL_C>();
	}
};
static_assert(alignof(ABP_FNFAL_C) == 0x000008, "Wrong alignment on ABP_FNFAL_C");
static_assert(sizeof(ABP_FNFAL_C) == 0x0005C0, "Wrong size on ABP_FNFAL_C");
static_assert(offsetof(ABP_FNFAL_C, TopRail) == 0x0005A8, "Member 'ABP_FNFAL_C::TopRail' has a wrong offset!");
static_assert(offsetof(ABP_FNFAL_C, IronSight) == 0x0005B0, "Member 'ABP_FNFAL_C::IronSight' has a wrong offset!");
static_assert(offsetof(ABP_FNFAL_C, FrontSightPost) == 0x0005B8, "Member 'ABP_FNFAL_C::FrontSightPost' has a wrong offset!");

}

