#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GBItemBeamComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_GBItemBeamComponent.BP_GBItemBeamComponent_C.ExecuteUbergraph_BP_GBItemBeamComponent
// 0x02E0 (0x02E0 - 0x0000)
struct BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         CallFunc_GetAsset_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBInvItem*                             K2Node_DynamicCast_AsGBInv_Item;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGBCharacter*                           K2Node_Event_Character;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBCharacter*                           K2Node_CustomEvent_Character;                      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAlive_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable_1;                             // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         Temp_object_Variable;                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_4;                             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_5;                             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_2;                           // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_6;                             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBPlayerController*                    K2Node_DynamicCast_AsGBPlayer_Controller;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGBCharacter*                           K2Node_DynamicCast_AsGBCharacter;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AGBInvItem*>                     CallFunc_GetInventoryList_ReturnValue;             // 0x0120(0x0010)(ReferenceParm)
	float                                         Temp_float_Variable_7;                             // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceRecursiveForObjects_OutHit;      // 0x0138(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceRecursiveForObjects_ReturnValue; // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_3;                           // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0260(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bLaserActive;                   // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26B[0x1];                                      // 0x026B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue;      // 0x0270(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue;    // 0x0280(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0294(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_Select_Default_4;                           // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue_1;  // 0x02B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CB[0x5];                                      // 0x02CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_CustomEvent_EmitterTemplate;                // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent) == 0x000008, "Wrong alignment on BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent");
static_assert(sizeof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent) == 0x0002E0, "Wrong size on BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, EntryPoint) == 0x000000, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, Temp_float_Variable) == 0x000014, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_GetAsset_ReturnValue) == 0x000020, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_GetAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_GetOwner_ReturnValue) == 0x000030, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, K2Node_DynamicCast_AsGBInv_Item) == 0x000038, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::K2Node_DynamicCast_AsGBInv_Item' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000044, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, K2Node_Event_Character) == 0x000058, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::K2Node_Event_Character' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, K2Node_CustomEvent_Character) == 0x000060, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_IsAlive_ReturnValue) == 0x000068, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_IsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000069, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_Not_PreBool_ReturnValue) == 0x00006A, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_IsValid_ReturnValue_2) == 0x00006B, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, Temp_float_Variable_1) == 0x00006C, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, Temp_bool_Variable) == 0x000070, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, K2Node_Select_Default) == 0x000074, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_Not_PreBool_ReturnValue_1) == 0x000078, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_Not_PreBool_ReturnValue_2) == 0x000079, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, Temp_float_Variable_2) == 0x00007C, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, Temp_float_Variable_3) == 0x000080, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, Temp_bool_Variable_1) == 0x000084, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_IsValid_ReturnValue_3) == 0x000085, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, K2Node_Select_Default_1) == 0x000088, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, Temp_object_Variable) == 0x000090, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, Temp_float_Variable_4) == 0x000098, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::Temp_float_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, Temp_float_Variable_5) == 0x00009C, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::Temp_float_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, Temp_bool_Variable_2) == 0x0000A0, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_IsValid_ReturnValue_4) == 0x0000A1, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, K2Node_Select_Default_2) == 0x0000A4, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_IsValid_ReturnValue_5) == 0x0000A8, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, Temp_float_Variable_6) == 0x0000AC, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::Temp_float_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_GetPlayerController_ReturnValue) == 0x0000B0, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, K2Node_DynamicCast_AsGBPlayer_Controller) == 0x0000B8, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::K2Node_DynamicCast_AsGBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000C4, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_GetForwardVector_ReturnValue) == 0x0000D0, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000DC, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_Add_VectorVector_ReturnValue) == 0x0000E8, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_MakeVector_ReturnValue) == 0x0000F4, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_GetOwner_ReturnValue_1) == 0x000100, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000108, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_IsValid_ReturnValue_6) == 0x000109, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, K2Node_DynamicCast_AsGBCharacter) == 0x000110, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::K2Node_DynamicCast_AsGBCharacter' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, K2Node_DynamicCast_bSuccess_2) == 0x000118, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_Array_AddUnique_ReturnValue) == 0x00011C, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_GetInventoryList_ReturnValue) == 0x000120, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_GetInventoryList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, Temp_float_Variable_7) == 0x000130, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::Temp_float_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, Temp_bool_Variable_3) == 0x000134, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_LineTraceRecursiveForObjects_OutHit) == 0x000138, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_LineTraceRecursiveForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_LineTraceRecursiveForObjects_ReturnValue) == 0x0001C0, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_LineTraceRecursiveForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, K2Node_Select_Default_3) == 0x0001C4, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_BreakHitResult_bBlockingHit) == 0x0001C8, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001C9, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_BreakHitResult_Time) == 0x0001CC, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_BreakHitResult_Distance) == 0x0001D0, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_BreakHitResult_Location) == 0x0001D4, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_BreakHitResult_ImpactPoint) == 0x0001E0, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_BreakHitResult_Normal) == 0x0001EC, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_BreakHitResult_ImpactNormal) == 0x0001F8, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_BreakHitResult_PhysMat) == 0x000208, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_BreakHitResult_HitActor) == 0x000210, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_BreakHitResult_HitComponent) == 0x000218, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_BreakHitResult_HitBoneName) == 0x000220, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_BreakHitResult_HitItem) == 0x000228, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_BreakHitResult_ElementIndex) == 0x00022C, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_BreakHitResult_FaceIndex) == 0x000230, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_BreakHitResult_TraceStart) == 0x000234, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_BreakHitResult_TraceEnd) == 0x000240, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_RandomFloatInRange_ReturnValue) == 0x00024C, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000250, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_IsServer_ReturnValue) == 0x000254, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_SelectFloat_ReturnValue) == 0x000258, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000260, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_BooleanAND_ReturnValue) == 0x000268, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, K2Node_CustomEvent_bLaserActive) == 0x000269, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::K2Node_CustomEvent_bLaserActive' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x00026A, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, K2Node_Event_DeltaSeconds) == 0x00026C, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_GetVectorParameterValue_ReturnValue) == 0x000270, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_Multiply_LinearColorFloat_ReturnValue) == 0x000280, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_Multiply_LinearColorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, Temp_bool_Variable_4) == 0x000290, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_SelectColor_ReturnValue) == 0x000294, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, K2Node_Select_Default_4) == 0x0002A8, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_Multiply_LinearColorFloat_ReturnValue_1) == 0x0002B0, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_Multiply_LinearColorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_SpawnSystemAttached_ReturnValue) == 0x0002C0, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0002C8, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_IsValid_ReturnValue_7) == 0x0002C9, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x0002CA, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, K2Node_CustomEvent_EmitterTemplate) == 0x0002D0, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::K2Node_CustomEvent_EmitterTemplate' has a wrong offset!");
static_assert(offsetof(BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0002D8, "Member 'BP_GBItemBeamComponent_C_ExecuteUbergraph_BP_GBItemBeamComponent::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_GBItemBeamComponent.BP_GBItemBeamComponent_C.SetBeamParticleSystem
// 0x0008 (0x0008 - 0x0000)
struct BP_GBItemBeamComponent_C_SetBeamParticleSystem final
{
public:
	class UNiagaraSystem*                         EmitterTemplate;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GBItemBeamComponent_C_SetBeamParticleSystem) == 0x000008, "Wrong alignment on BP_GBItemBeamComponent_C_SetBeamParticleSystem");
static_assert(sizeof(BP_GBItemBeamComponent_C_SetBeamParticleSystem) == 0x000008, "Wrong size on BP_GBItemBeamComponent_C_SetBeamParticleSystem");
static_assert(offsetof(BP_GBItemBeamComponent_C_SetBeamParticleSystem, EmitterTemplate) == 0x000000, "Member 'BP_GBItemBeamComponent_C_SetBeamParticleSystem::EmitterTemplate' has a wrong offset!");

// Function BP_GBItemBeamComponent.BP_GBItemBeamComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_GBItemBeamComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GBItemBeamComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_GBItemBeamComponent_C_ReceiveTick");
static_assert(sizeof(BP_GBItemBeamComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_GBItemBeamComponent_C_ReceiveTick");
static_assert(offsetof(BP_GBItemBeamComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_GBItemBeamComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_GBItemBeamComponent.BP_GBItemBeamComponent_C.MulticastSetLaserActive
// 0x0001 (0x0001 - 0x0000)
struct BP_GBItemBeamComponent_C_MulticastSetLaserActive final
{
public:
	bool                                          bLaserActive_0;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GBItemBeamComponent_C_MulticastSetLaserActive) == 0x000001, "Wrong alignment on BP_GBItemBeamComponent_C_MulticastSetLaserActive");
static_assert(sizeof(BP_GBItemBeamComponent_C_MulticastSetLaserActive) == 0x000001, "Wrong size on BP_GBItemBeamComponent_C_MulticastSetLaserActive");
static_assert(offsetof(BP_GBItemBeamComponent_C_MulticastSetLaserActive, bLaserActive_0) == 0x000000, "Member 'BP_GBItemBeamComponent_C_MulticastSetLaserActive::bLaserActive_0' has a wrong offset!");

// Function BP_GBItemBeamComponent.BP_GBItemBeamComponent_C.EnableAutoTurnOffMaybe
// 0x0008 (0x0008 - 0x0000)
struct BP_GBItemBeamComponent_C_EnableAutoTurnOffMaybe final
{
public:
	class AGBCharacter*                           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GBItemBeamComponent_C_EnableAutoTurnOffMaybe) == 0x000008, "Wrong alignment on BP_GBItemBeamComponent_C_EnableAutoTurnOffMaybe");
static_assert(sizeof(BP_GBItemBeamComponent_C_EnableAutoTurnOffMaybe) == 0x000008, "Wrong size on BP_GBItemBeamComponent_C_EnableAutoTurnOffMaybe");
static_assert(offsetof(BP_GBItemBeamComponent_C_EnableAutoTurnOffMaybe, Character) == 0x000000, "Member 'BP_GBItemBeamComponent_C_EnableAutoTurnOffMaybe::Character' has a wrong offset!");

// Function BP_GBItemBeamComponent.BP_GBItemBeamComponent_C.OnRemovedFromInventory
// 0x0008 (0x0008 - 0x0000)
struct BP_GBItemBeamComponent_C_OnRemovedFromInventory final
{
public:
	class AGBCharacter*                           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GBItemBeamComponent_C_OnRemovedFromInventory) == 0x000008, "Wrong alignment on BP_GBItemBeamComponent_C_OnRemovedFromInventory");
static_assert(sizeof(BP_GBItemBeamComponent_C_OnRemovedFromInventory) == 0x000008, "Wrong size on BP_GBItemBeamComponent_C_OnRemovedFromInventory");
static_assert(offsetof(BP_GBItemBeamComponent_C_OnRemovedFromInventory, Character) == 0x000000, "Member 'BP_GBItemBeamComponent_C_OnRemovedFromInventory::Character' has a wrong offset!");

// Function BP_GBItemBeamComponent.BP_GBItemBeamComponent_C.GetLaserActive
// 0x0001 (0x0001 - 0x0000)
struct BP_GBItemBeamComponent_C_GetLaserActive final
{
public:
	bool                                          OutLaserActive;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GBItemBeamComponent_C_GetLaserActive) == 0x000001, "Wrong alignment on BP_GBItemBeamComponent_C_GetLaserActive");
static_assert(sizeof(BP_GBItemBeamComponent_C_GetLaserActive) == 0x000001, "Wrong size on BP_GBItemBeamComponent_C_GetLaserActive");
static_assert(offsetof(BP_GBItemBeamComponent_C_GetLaserActive, OutLaserActive) == 0x000000, "Member 'BP_GBItemBeamComponent_C_GetLaserActive::OutLaserActive' has a wrong offset!");

}

