#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OKP7

#include "Basic.hpp"

#include "GroundBranch_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OKP7.BP_OKP7_C
// 0x0018 (0x0490 - 0x0478)
class ABP_OKP7_C final : public AGBRailAttachment
{
public:
	class UGBRailMountComponent*                  GBRailMount;                                       // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGBSightComponent*                      GBSight;                                           // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_OKP_7;                                          // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OKP7_C">();
	}
	static class ABP_OKP7_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OKP7_C>();
	}
};
static_assert(alignof(ABP_OKP7_C) == 0x000008, "Wrong alignment on ABP_OKP7_C");
static_assert(sizeof(ABP_OKP7_C) == 0x000490, "Wrong size on ABP_OKP7_C");
static_assert(offsetof(ABP_OKP7_C, GBRailMount) == 0x000478, "Member 'ABP_OKP7_C::GBRailMount' has a wrong offset!");
static_assert(offsetof(ABP_OKP7_C, GBSight) == 0x000480, "Member 'ABP_OKP7_C::GBSight' has a wrong offset!");
static_assert(offsetof(ABP_OKP7_C, SM_OKP_7) == 0x000488, "Member 'ABP_OKP7_C::SM_OKP_7' has a wrong offset!");

}

