#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "GroundBranch_structs.hpp"
#include "ModKit_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerController.BP_PlayerController_C.TraceFwd
// 0x0170 (0x0170 - 0x0000)
struct BP_PlayerController_C_TraceFwd final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ImpactPoint;                                       // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HitActor;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0018(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetActorEyesViewPoint_OutLocation;        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetActorEyesViewPoint_OutRotation;        // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0064(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EF[0x1];                                       // 0x00EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerController_C_TraceFwd) == 0x000008, "Wrong alignment on BP_PlayerController_C_TraceFwd");
static_assert(sizeof(BP_PlayerController_C_TraceFwd) == 0x000170, "Wrong size on BP_PlayerController_C_TraceFwd");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, ReturnValue) == 0x000000, "Member 'BP_PlayerController_C_TraceFwd::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, ImpactPoint) == 0x000004, "Member 'BP_PlayerController_C_TraceFwd::ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, HitActor) == 0x000010, "Member 'BP_PlayerController_C_TraceFwd::HitActor' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, Temp_object_Variable) == 0x000018, "Member 'BP_PlayerController_C_TraceFwd::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, CallFunc_GetActorEyesViewPoint_OutLocation) == 0x000028, "Member 'BP_PlayerController_C_TraceFwd::CallFunc_GetActorEyesViewPoint_OutLocation' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, CallFunc_GetActorEyesViewPoint_OutRotation) == 0x000034, "Member 'BP_PlayerController_C_TraceFwd::CallFunc_GetActorEyesViewPoint_OutRotation' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, CallFunc_GetForwardVector_ReturnValue) == 0x000040, "Member 'BP_PlayerController_C_TraceFwd::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00004C, "Member 'BP_PlayerController_C_TraceFwd::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, CallFunc_Add_VectorVector_ReturnValue) == 0x000058, "Member 'BP_PlayerController_C_TraceFwd::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, CallFunc_LineTraceSingle_OutHit) == 0x000064, "Member 'BP_PlayerController_C_TraceFwd::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, CallFunc_LineTraceSingle_ReturnValue) == 0x0000EC, "Member 'BP_PlayerController_C_TraceFwd::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, CallFunc_BreakHitResult_bBlockingHit) == 0x0000ED, "Member 'BP_PlayerController_C_TraceFwd::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000EE, "Member 'BP_PlayerController_C_TraceFwd::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, CallFunc_BreakHitResult_Time) == 0x0000F0, "Member 'BP_PlayerController_C_TraceFwd::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, CallFunc_BreakHitResult_Distance) == 0x0000F4, "Member 'BP_PlayerController_C_TraceFwd::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, CallFunc_BreakHitResult_Location) == 0x0000F8, "Member 'BP_PlayerController_C_TraceFwd::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, CallFunc_BreakHitResult_ImpactPoint) == 0x000104, "Member 'BP_PlayerController_C_TraceFwd::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, CallFunc_BreakHitResult_Normal) == 0x000110, "Member 'BP_PlayerController_C_TraceFwd::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, CallFunc_BreakHitResult_ImpactNormal) == 0x00011C, "Member 'BP_PlayerController_C_TraceFwd::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, CallFunc_BreakHitResult_PhysMat) == 0x000128, "Member 'BP_PlayerController_C_TraceFwd::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, CallFunc_BreakHitResult_HitActor) == 0x000130, "Member 'BP_PlayerController_C_TraceFwd::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, CallFunc_BreakHitResult_HitComponent) == 0x000138, "Member 'BP_PlayerController_C_TraceFwd::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, CallFunc_BreakHitResult_HitBoneName) == 0x000140, "Member 'BP_PlayerController_C_TraceFwd::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, CallFunc_BreakHitResult_HitItem) == 0x000148, "Member 'BP_PlayerController_C_TraceFwd::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, CallFunc_BreakHitResult_ElementIndex) == 0x00014C, "Member 'BP_PlayerController_C_TraceFwd::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, CallFunc_BreakHitResult_FaceIndex) == 0x000150, "Member 'BP_PlayerController_C_TraceFwd::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, CallFunc_BreakHitResult_TraceStart) == 0x000154, "Member 'BP_PlayerController_C_TraceFwd::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_TraceFwd, CallFunc_BreakHitResult_TraceEnd) == 0x000160, "Member 'BP_PlayerController_C_TraceFwd::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");

// Function BP_PlayerController.BP_PlayerController_C.HasKitWithFailedJson
// 0x0098 (0x0098 - 0x0000)
struct BP_PlayerController_C_HasKitWithFailedJson final
{
public:
	bool                                          bOutJsonWasInvalid;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLocalJsonWasInvalid;                              // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGBKitValidationInfo>           CallFunc_GetFailedKitValidations_ReturnValue;      // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGBKitValidationInfo                   CallFunc_Array_Get_Item;                           // 0x0030(0x0060)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerController_C_HasKitWithFailedJson) == 0x000008, "Wrong alignment on BP_PlayerController_C_HasKitWithFailedJson");
static_assert(sizeof(BP_PlayerController_C_HasKitWithFailedJson) == 0x000098, "Wrong size on BP_PlayerController_C_HasKitWithFailedJson");
static_assert(offsetof(BP_PlayerController_C_HasKitWithFailedJson, bOutJsonWasInvalid) == 0x000000, "Member 'BP_PlayerController_C_HasKitWithFailedJson::bOutJsonWasInvalid' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_HasKitWithFailedJson, bLocalJsonWasInvalid) == 0x000001, "Member 'BP_PlayerController_C_HasKitWithFailedJson::bLocalJsonWasInvalid' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_HasKitWithFailedJson, Temp_bool_True_if_break_was_hit_Variable) == 0x000002, "Member 'BP_PlayerController_C_HasKitWithFailedJson::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_HasKitWithFailedJson, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_PlayerController_C_HasKitWithFailedJson::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_HasKitWithFailedJson, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'BP_PlayerController_C_HasKitWithFailedJson::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_HasKitWithFailedJson, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_PlayerController_C_HasKitWithFailedJson::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_HasKitWithFailedJson, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_PlayerController_C_HasKitWithFailedJson::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_HasKitWithFailedJson, CallFunc_GetFailedKitValidations_ReturnValue) == 0x000018, "Member 'BP_PlayerController_C_HasKitWithFailedJson::CallFunc_GetFailedKitValidations_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_HasKitWithFailedJson, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_PlayerController_C_HasKitWithFailedJson::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_HasKitWithFailedJson, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_PlayerController_C_HasKitWithFailedJson::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_HasKitWithFailedJson, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'BP_PlayerController_C_HasKitWithFailedJson::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_HasKitWithFailedJson, CallFunc_BooleanAND_ReturnValue) == 0x000091, "Member 'BP_PlayerController_C_HasKitWithFailedJson::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_HasKitWithFailedJson, CallFunc_Not_PreBool_ReturnValue_1) == 0x000092, "Member 'BP_PlayerController_C_HasKitWithFailedJson::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function BP_PlayerController.BP_PlayerController_C.ToggleDebugLightDetector
// 0x0018 (0x0018 - 0x0000)
struct BP_PlayerController_C_ToggleDebugLightDetector final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_LxrCanvas_C*                        CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerController_C_ToggleDebugLightDetector) == 0x000008, "Wrong alignment on BP_PlayerController_C_ToggleDebugLightDetector");
static_assert(sizeof(BP_PlayerController_C_ToggleDebugLightDetector) == 0x000018, "Wrong size on BP_PlayerController_C_ToggleDebugLightDetector");
static_assert(offsetof(BP_PlayerController_C_ToggleDebugLightDetector, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_PlayerController_C_ToggleDebugLightDetector::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_ToggleDebugLightDetector, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_PlayerController_C_ToggleDebugLightDetector::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_ToggleDebugLightDetector, CallFunc_Create_ReturnValue) == 0x000010, "Member 'BP_PlayerController_C_ToggleDebugLightDetector::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function BP_PlayerController.BP_PlayerController_C.OnLoaded_20127F524F4779842409348BE6B7D46D
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerController_C_OnLoaded_20127F524F4779842409348BE6B7D46D final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerController_C_OnLoaded_20127F524F4779842409348BE6B7D46D) == 0x000008, "Wrong alignment on BP_PlayerController_C_OnLoaded_20127F524F4779842409348BE6B7D46D");
static_assert(sizeof(BP_PlayerController_C_OnLoaded_20127F524F4779842409348BE6B7D46D) == 0x000008, "Wrong size on BP_PlayerController_C_OnLoaded_20127F524F4779842409348BE6B7D46D");
static_assert(offsetof(BP_PlayerController_C_OnLoaded_20127F524F4779842409348BE6B7D46D, Loaded) == 0x000000, "Member 'BP_PlayerController_C_OnLoaded_20127F524F4779842409348BE6B7D46D::Loaded' has a wrong offset!");

// Function BP_PlayerController.BP_PlayerController_C.InpActEvt_NumPadZero_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct BP_PlayerController_C_InpActEvt_NumPadZero_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerController_C_InpActEvt_NumPadZero_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on BP_PlayerController_C_InpActEvt_NumPadZero_K2Node_InputKeyEvent_0");
static_assert(sizeof(BP_PlayerController_C_InpActEvt_NumPadZero_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on BP_PlayerController_C_InpActEvt_NumPadZero_K2Node_InputKeyEvent_0");
static_assert(offsetof(BP_PlayerController_C_InpActEvt_NumPadZero_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'BP_PlayerController_C_InpActEvt_NumPadZero_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function BP_PlayerController.BP_PlayerController_C.ShowTransitionScreenEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerController_C_ShowTransitionScreenEvent final
{
public:
	class FName                                   TransitionType;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerController_C_ShowTransitionScreenEvent) == 0x000004, "Wrong alignment on BP_PlayerController_C_ShowTransitionScreenEvent");
static_assert(sizeof(BP_PlayerController_C_ShowTransitionScreenEvent) == 0x000008, "Wrong size on BP_PlayerController_C_ShowTransitionScreenEvent");
static_assert(offsetof(BP_PlayerController_C_ShowTransitionScreenEvent, TransitionType) == 0x000000, "Member 'BP_PlayerController_C_ShowTransitionScreenEvent::TransitionType' has a wrong offset!");

// Function BP_PlayerController.BP_PlayerController_C.HideTransitionScreenEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerController_C_HideTransitionScreenEvent final
{
public:
	class UUserWidget*                            LoadingScreenUserWidget;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerController_C_HideTransitionScreenEvent) == 0x000008, "Wrong alignment on BP_PlayerController_C_HideTransitionScreenEvent");
static_assert(sizeof(BP_PlayerController_C_HideTransitionScreenEvent) == 0x000008, "Wrong size on BP_PlayerController_C_HideTransitionScreenEvent");
static_assert(offsetof(BP_PlayerController_C_HideTransitionScreenEvent, LoadingScreenUserWidget) == 0x000000, "Member 'BP_PlayerController_C_HideTransitionScreenEvent::LoadingScreenUserWidget' has a wrong offset!");

// Function BP_PlayerController.BP_PlayerController_C.OnAFKPromptEvent
// 0x0004 (0x0004 - 0x0000)
struct BP_PlayerController_C_OnAFKPromptEvent final
{
public:
	float                                         ReponseTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerController_C_OnAFKPromptEvent) == 0x000004, "Wrong alignment on BP_PlayerController_C_OnAFKPromptEvent");
static_assert(sizeof(BP_PlayerController_C_OnAFKPromptEvent) == 0x000004, "Wrong size on BP_PlayerController_C_OnAFKPromptEvent");
static_assert(offsetof(BP_PlayerController_C_OnAFKPromptEvent, ReponseTime) == 0x000000, "Member 'BP_PlayerController_C_OnAFKPromptEvent::ReponseTime' has a wrong offset!");

// Function BP_PlayerController.BP_PlayerController_C.OnShowWorldPromptEvent
// 0x0020 (0x0020 - 0x0000)
struct BP_PlayerController_C_OnShowWorldPromptEvent final
{
public:
	struct FVector                                PromptLocation;                                    // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Tag;                                               // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUInt64                                ModID;                                             // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerController_C_OnShowWorldPromptEvent) == 0x000008, "Wrong alignment on BP_PlayerController_C_OnShowWorldPromptEvent");
static_assert(sizeof(BP_PlayerController_C_OnShowWorldPromptEvent) == 0x000020, "Wrong size on BP_PlayerController_C_OnShowWorldPromptEvent");
static_assert(offsetof(BP_PlayerController_C_OnShowWorldPromptEvent, PromptLocation) == 0x000000, "Member 'BP_PlayerController_C_OnShowWorldPromptEvent::PromptLocation' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_OnShowWorldPromptEvent, Tag) == 0x00000C, "Member 'BP_PlayerController_C_OnShowWorldPromptEvent::Tag' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_OnShowWorldPromptEvent, Duration) == 0x000014, "Member 'BP_PlayerController_C_OnShowWorldPromptEvent::Duration' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_OnShowWorldPromptEvent, ModID) == 0x000018, "Member 'BP_PlayerController_C_OnShowWorldPromptEvent::ModID' has a wrong offset!");

// Function BP_PlayerController.BP_PlayerController_C.OnFailedValidationOkClicked_Event
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerController_C_OnFailedValidationOkClicked_Event final
{
public:
	class UWBP_DialogueBox_C*                     Dialogue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerController_C_OnFailedValidationOkClicked_Event) == 0x000008, "Wrong alignment on BP_PlayerController_C_OnFailedValidationOkClicked_Event");
static_assert(sizeof(BP_PlayerController_C_OnFailedValidationOkClicked_Event) == 0x000008, "Wrong size on BP_PlayerController_C_OnFailedValidationOkClicked_Event");
static_assert(offsetof(BP_PlayerController_C_OnFailedValidationOkClicked_Event, Dialogue) == 0x000000, "Member 'BP_PlayerController_C_OnFailedValidationOkClicked_Event::Dialogue' has a wrong offset!");

// Function BP_PlayerController.BP_PlayerController_C.OnFailedJsonOkClicked_Event
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerController_C_OnFailedJsonOkClicked_Event final
{
public:
	class UWBP_DialogueBox_C*                     Dialogue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerController_C_OnFailedJsonOkClicked_Event) == 0x000008, "Wrong alignment on BP_PlayerController_C_OnFailedJsonOkClicked_Event");
static_assert(sizeof(BP_PlayerController_C_OnFailedJsonOkClicked_Event) == 0x000008, "Wrong size on BP_PlayerController_C_OnFailedJsonOkClicked_Event");
static_assert(offsetof(BP_PlayerController_C_OnFailedJsonOkClicked_Event, Dialogue) == 0x000000, "Member 'BP_PlayerController_C_OnFailedJsonOkClicked_Event::Dialogue' has a wrong offset!");

// Function BP_PlayerController.BP_PlayerController_C.OnAlreadyAttemptedRemoveOrReplaceOkClient_Event
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerController_C_OnAlreadyAttemptedRemoveOrReplaceOkClient_Event final
{
public:
	class UWBP_DialogueBox_C*                     Dialogue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerController_C_OnAlreadyAttemptedRemoveOrReplaceOkClient_Event) == 0x000008, "Wrong alignment on BP_PlayerController_C_OnAlreadyAttemptedRemoveOrReplaceOkClient_Event");
static_assert(sizeof(BP_PlayerController_C_OnAlreadyAttemptedRemoveOrReplaceOkClient_Event) == 0x000008, "Wrong size on BP_PlayerController_C_OnAlreadyAttemptedRemoveOrReplaceOkClient_Event");
static_assert(offsetof(BP_PlayerController_C_OnAlreadyAttemptedRemoveOrReplaceOkClient_Event, Dialogue) == 0x000000, "Member 'BP_PlayerController_C_OnAlreadyAttemptedRemoveOrReplaceOkClient_Event::Dialogue' has a wrong offset!");

// Function BP_PlayerController.BP_PlayerController_C.OnMissionObjectiveStatusUpdateEvent
// 0x0018 (0x0018 - 0x0000)
struct BP_PlayerController_C_OnMissionObjectiveStatusUpdateEvent final
{
public:
	EGBMissionObjectiveStatusUpdateType           StatusUpdateType;                                  // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGBMissionObjective*                    MissionObjective;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatParam;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerController_C_OnMissionObjectiveStatusUpdateEvent) == 0x000008, "Wrong alignment on BP_PlayerController_C_OnMissionObjectiveStatusUpdateEvent");
static_assert(sizeof(BP_PlayerController_C_OnMissionObjectiveStatusUpdateEvent) == 0x000018, "Wrong size on BP_PlayerController_C_OnMissionObjectiveStatusUpdateEvent");
static_assert(offsetof(BP_PlayerController_C_OnMissionObjectiveStatusUpdateEvent, StatusUpdateType) == 0x000000, "Member 'BP_PlayerController_C_OnMissionObjectiveStatusUpdateEvent::StatusUpdateType' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_OnMissionObjectiveStatusUpdateEvent, MissionObjective) == 0x000008, "Member 'BP_PlayerController_C_OnMissionObjectiveStatusUpdateEvent::MissionObjective' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_OnMissionObjectiveStatusUpdateEvent, FloatParam) == 0x000010, "Member 'BP_PlayerController_C_OnMissionObjectiveStatusUpdateEvent::FloatParam' has a wrong offset!");

// Function BP_PlayerController.BP_PlayerController_C.ReceivePossess
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerController_C_ReceivePossess final
{
public:
	class APawn*                                  PossessedPawn;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerController_C_ReceivePossess) == 0x000008, "Wrong alignment on BP_PlayerController_C_ReceivePossess");
static_assert(sizeof(BP_PlayerController_C_ReceivePossess) == 0x000008, "Wrong size on BP_PlayerController_C_ReceivePossess");
static_assert(offsetof(BP_PlayerController_C_ReceivePossess, PossessedPawn) == 0x000000, "Member 'BP_PlayerController_C_ReceivePossess::PossessedPawn' has a wrong offset!");

// Function BP_PlayerController.BP_PlayerController_C.ExecuteUbergraph_BP_PlayerController
// 0x0680 (0x0680 - 0x0000)
struct BP_PlayerController_C_ExecuteUbergraph_BP_PlayerController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MissionEditor_C*                   CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_AFKPrompt_C*                       CallFunc_Create_ReturnValue_1;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HUD_C*                              K2Node_DynamicCast_AsBP_HUD;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Transition_C*                      CallFunc_Create_ReturnValue_2;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_TransitionType;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_LoadingScreenUserWidget;              // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Transition_C*                      CallFunc_GetFirstWidgetOfClass_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_LoadingScreen_C*                   K2Node_DynamicCast_AsWBP_Loading_Screen;           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_ReponseTime;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MissionEditor_C*                   CallFunc_GetFirstWidgetOfClass_ReturnValue_1;      // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_PromptLocation;                       // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Tag;                                  // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Duration;                             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUInt64                                K2Node_Event_ModID;                                // 0x00A0(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AB[0x1];                                       // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue_3;                     // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_AFKPrompt_C*                       CallFunc_GetFirstWidgetOfClass_ReturnValue_2;      // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasFailedKitValidations_ReturnValue;      // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DialogueBox_C*                     K2Node_CustomEvent_dialogue_2;                     // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGBKitValidationInfo>           CallFunc_GetFailedKitValidations_ReturnValue;      // 0x0120(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGBKitValidationInfo                   CallFunc_Array_Get_Item;                           // 0x0138(0x0060)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetUserLoadoutFileName_ReturnValue;       // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FGBKitValidationInfo>           CallFunc_GetFailedKitValidations_ReturnValue_1;    // 0x01B0(0x0010)(ReferenceParm)
	class UVaRestJsonObject*                      CallFunc_LoadKitFile_OutKitJsonObj;                // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadKitFile_ReturnValue;                  // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_EncodeJson_ReturnValue;                   // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProcessFailedKit_ReturnValue;             // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SaveStringToFile_ReturnValue;             // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasKitWithFailedJson_bOutJsonWasInvalid;  // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E3[0x5];                                      // 0x01E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DialogueBox_C*                     K2Node_CustomEvent_dialogue_1;                     // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_ReturnValue_1;                   // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEditor_ReturnValue_2;                   // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetUserDir_ReturnValue;                   // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetKitExtension_ReturnValue;              // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_ReturnValue_3;                   // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetFailedKitNames_OutFailedLoadouts;      // 0x0220(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0238(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetFailedKitNames_OutFailedLoadouts_1;    // 0x0278(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0290(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x02A0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x02E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x02F0(0x0018)()
	class UWBP_DialogueBox_C*                     K2Node_CustomEvent_dialogue;                       // 0x0308(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetFailedKitNames_OutFailedLoadouts_2;    // 0x0310(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0328(0x0040)(HasGetValueTypeHash)
	TArray<struct FGBKitValidationInfo>           CallFunc_GetFailedKitValidations_ReturnValue_2;    // 0x0368(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0378(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0390(0x0018)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGBKitValidationInfo                   CallFunc_Array_Get_Item_1;                         // 0x03B8(0x0060)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetUserLoadoutFileName_ReturnValue_1;     // 0x0420(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_DeleteFile_ReturnValue;                   // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x3];                                      // 0x0431(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x043C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43D[0x3];                                      // 0x043D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0444(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_445[0x3];                                      // 0x0445(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGBKitValidationInfo                   CallFunc_Array_Get_Item_2;                         // 0x0458(0x0060)()
	class FString                                 CallFunc_GetUserLoadoutFileName_ReturnValue_2;     // 0x04B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonObject*                      CallFunc_LoadKitFile_OutKitJsonObj_1;              // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadKitFile_ReturnValue_1;                // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_EncodeJson_ReturnValue_1;                 // 0x04E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProcessFailedKit_ReturnValue_1;           // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SaveStringToFile_ReturnValue_1;           // 0x04F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F2[0x2];                                      // 0x04F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x04F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_DialogueBox_C*                     CallFunc_GetFirstWidgetOfClass_ReturnValue_3;      // 0x04F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0508(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULoadingScreenManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_World_Prompt_C*>            CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0530(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_GetLoadingScreenDisplayStatus_ReturnValue; // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_World_Prompt_C*                    CallFunc_Array_Get_Item_3;                         // 0x0548(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0551(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0552(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_553[0x5];                                      // 0x0553(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_World_Prompt_C*                    CallFunc_Array_Get_Item_4;                         // 0x0558(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UInt64Equals_ReturnValue;                 // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0561(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_562[0x6];                                      // 0x0562(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_World_Prompt_C*                    CallFunc_Array_Get_Item_5;                         // 0x0568(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571[0x3];                                      // 0x0571(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x057C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0581(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0582(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_583[0x1];                                      // 0x0583(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWBP_DialogueBox_C* Dialogue)> K2Node_CreateDelegate_OutputDelegate;        // 0x0584(0x0010)(ZeroConstructor, NoDestructor)
