#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_AI_CheckDeadBody

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_AI_CheckDeadBody.GA_AI_CheckDeadBody_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_AI_CheckDeadBody_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_AI_CheckDeadBody_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_AI_CheckDeadBody_C_K2_OnEndAbility");
static_assert(sizeof(GA_AI_CheckDeadBody_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_AI_CheckDeadBody_C_K2_OnEndAbility");
static_assert(offsetof(GA_AI_CheckDeadBody_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_AI_CheckDeadBody_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_AI_CheckDeadBody.GA_AI_CheckDeadBody_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_AI_CheckDeadBody_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_AI_CheckDeadBody_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_AI_CheckDeadBody_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_AI_CheckDeadBody_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_AI_CheckDeadBody_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_AI_CheckDeadBody_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_AI_CheckDeadBody_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_AI_CheckDeadBody.GA_AI_CheckDeadBody_C.ExecuteUbergraph_GA_AI_CheckDeadBody
// 0x0120 (0x0120 - 0x0000)
struct GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_Array_Random_OutItem;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0068(0x00B0)(ConstParm)
	bool                                          CallFunc_RemoveLooseGameplayTag_ReturnValue;       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody) == 0x000008, "Wrong alignment on GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody");
static_assert(sizeof(GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody) == 0x000120, "Wrong size on GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody");
static_assert(offsetof(GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody, EntryPoint) == 0x000000, "Member 'GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody, CallFunc_Array_Random_OutItem) == 0x000008, "Member 'GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody, CallFunc_Array_Random_OutIndex) == 0x000010, "Member 'GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000028, "Member 'GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody, K2Node_CreateDelegate_OutputDelegate_3) == 0x000054, "Member 'GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody, K2Node_Event_bWasCancelled) == 0x000064, "Member 'GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody, K2Node_Event_EventData) == 0x000068, "Member 'GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody, CallFunc_RemoveLooseGameplayTag_ReturnValue) == 0x000118, "Member 'GA_AI_CheckDeadBody_C_ExecuteUbergraph_GA_AI_CheckDeadBody::CallFunc_RemoveLooseGameplayTag_ReturnValue' has a wrong offset!");

}

