#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_AI_CheckDeadBody

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GroundBranch_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_AI_CheckDeadBody.GA_AI_CheckDeadBody_C
// 0x0028 (0x03E0 - 0x03B8)
class UGA_AI_CheckDeadBody_C final : public UGBGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UAnimMontage*>                   Montage_to_Play;                                   // 0x03C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsPlaying;                                        // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Target;                                            // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnCancelled_306D6338463772A31E4BFCAEC872023F();
	void OnInterrupted_306D6338463772A31E4BFCAEC872023F();
	void OnBlendOut_306D6338463772A31E4BFCAEC872023F();
	void OnCompleted_306D6338463772A31E4BFCAEC872023F();
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void ExecuteUbergraph_GA_AI_CheckDeadBody(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_AI_CheckDeadBody_C">();
	}
	static class UGA_AI_CheckDeadBody_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_AI_CheckDeadBody_C>();
	}
};
static_assert(alignof(UGA_AI_CheckDeadBody_C) == 0x000008, "Wrong alignment on UGA_AI_CheckDeadBody_C");
static_assert(sizeof(UGA_AI_CheckDeadBody_C) == 0x0003E0, "Wrong size on UGA_AI_CheckDeadBody_C");
static_assert(offsetof(UGA_AI_CheckDeadBody_C, UberGraphFrame) == 0x0003B8, "Member 'UGA_AI_CheckDeadBody_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_AI_CheckDeadBody_C, Montage_to_Play) == 0x0003C0, "Member 'UGA_AI_CheckDeadBody_C::Montage_to_Play' has a wrong offset!");
static_assert(offsetof(UGA_AI_CheckDeadBody_C, bIsPlaying) == 0x0003D0, "Member 'UGA_AI_CheckDeadBody_C::bIsPlaying' has a wrong offset!");
static_assert(offsetof(UGA_AI_CheckDeadBody_C, Target) == 0x0003D8, "Member 'UGA_AI_CheckDeadBody_C::Target' has a wrong offset!");

}

