#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Emote

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Emote.GA_Emote_C.ExecuteUbergraph_GA_Emote
// 0x0118 (0x0118 - 0x0000)
struct GA_Emote_C_ExecuteUbergraph_GA_Emote final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0048(0x00B0)(ConstParm)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Emote_C_ExecuteUbergraph_GA_Emote) == 0x000008, "Wrong alignment on GA_Emote_C_ExecuteUbergraph_GA_Emote");
static_assert(sizeof(GA_Emote_C_ExecuteUbergraph_GA_Emote) == 0x000118, "Wrong size on GA_Emote_C_ExecuteUbergraph_GA_Emote");
static_assert(offsetof(GA_Emote_C_ExecuteUbergraph_GA_Emote, EntryPoint) == 0x000000, "Member 'GA_Emote_C_ExecuteUbergraph_GA_Emote::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Emote_C_ExecuteUbergraph_GA_Emote, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Emote_C_ExecuteUbergraph_GA_Emote::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Emote_C_ExecuteUbergraph_GA_Emote, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'GA_Emote_C_ExecuteUbergraph_GA_Emote::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Emote_C_ExecuteUbergraph_GA_Emote, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'GA_Emote_C_ExecuteUbergraph_GA_Emote::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Emote_C_ExecuteUbergraph_GA_Emote, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'GA_Emote_C_ExecuteUbergraph_GA_Emote::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Emote_C_ExecuteUbergraph_GA_Emote, K2Node_Event_EventData) == 0x000048, "Member 'GA_Emote_C_ExecuteUbergraph_GA_Emote::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Emote_C_ExecuteUbergraph_GA_Emote, K2Node_DynamicCast_AsAnim_Montage) == 0x0000F8, "Member 'GA_Emote_C_ExecuteUbergraph_GA_Emote::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(GA_Emote_C_ExecuteUbergraph_GA_Emote, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'GA_Emote_C_ExecuteUbergraph_GA_Emote::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Emote_C_ExecuteUbergraph_GA_Emote, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000108, "Member 'GA_Emote_C_ExecuteUbergraph_GA_Emote::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Emote_C_ExecuteUbergraph_GA_Emote, CallFunc_IsValid_ReturnValue) == 0x000110, "Member 'GA_Emote_C_ExecuteUbergraph_GA_Emote::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Emote.GA_Emote_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Emote_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Emote_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_Emote_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Emote_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_Emote_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Emote_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Emote_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

