#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_FireSelect_Master

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GroundBranch_structs.hpp"


namespace SDK::Params
{

// Function GA_FireSelect_Master.GA_FireSelect_Master_C.ExecuteUbergraph_GA_FireSelect_Master
// 0x0280 (0x0280 - 0x0000)
struct GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0028(0x00B0)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_2; // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00E8(0x00B0)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0198(0x0010)(ZeroConstructor, NoDestructor)
	class AGBCharacter*                           CallFunc_GetCharacter_ReturnValue;                 // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBPlayerController*                    CallFunc_GetLocalViewer_ReturnValue;               // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HUD_C*                              K2Node_DynamicCast_AsBP_HUD;                       // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGBCharacter*                           CallFunc_GetCharacter_ReturnValue_1;               // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FireMode_Manager_C*                CallFunc_GetFirstChildWidgetOfClass_ReturnValue;   // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGBCharacter*                           CallFunc_GetCharacter_ReturnValue_2;               // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBInvItem*                             CallFunc_GetEquipped_ReturnValue;                  // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetFiringModeIndex_ReturnValue;           // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGBFirearm*                             K2Node_DynamicCast_AsGBFirearm;                    // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFiringModeData>                CallFunc_GetFiringModes_ReturnValue;               // 0x0220(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ChangeFiringModeIndex_ReturnValue;        // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_ByteByte_ReturnValue;                // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23B[0x1];                                      // 0x023B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x023C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_252[0x6];                                      // 0x0252(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayEvent*        CallFunc_WaitGameplayEventToActor_ReturnValue;     // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0268(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master) == 0x000008, "Wrong alignment on GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master");
static_assert(sizeof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master) == 0x000280, "Wrong size on GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, EntryPoint) == 0x000000, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, Temp_bool_Variable) == 0x000024, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, K2Node_CustomEvent_Payload) == 0x000028, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000D8, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, Temp_struct_Variable) == 0x0000E8, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, K2Node_CreateDelegate_OutputDelegate_3) == 0x000198, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, CallFunc_GetCharacter_ReturnValue) == 0x0001A8, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, CallFunc_GetLocalViewer_ReturnValue) == 0x0001B0, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::CallFunc_GetLocalViewer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, CallFunc_IsValid_ReturnValue) == 0x0001B8, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, CallFunc_GetHUD_ReturnValue) == 0x0001C0, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, K2Node_DynamicCast_AsBP_HUD) == 0x0001C8, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::K2Node_DynamicCast_AsBP_HUD' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, K2Node_DynamicCast_bSuccess) == 0x0001D0, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, CallFunc_GetCharacter_ReturnValue_1) == 0x0001D8, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::CallFunc_GetCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, CallFunc_IsLocallyControlled_ReturnValue) == 0x0001E0, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, CallFunc_GetFirstChildWidgetOfClass_ReturnValue) == 0x0001E8, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::CallFunc_GetFirstChildWidgetOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, CallFunc_IsValid_ReturnValue_1) == 0x0001F0, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, CallFunc_IsValid_ReturnValue_2) == 0x0001F1, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, CallFunc_GetCharacter_ReturnValue_2) == 0x0001F8, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::CallFunc_GetCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, CallFunc_GetEquipped_ReturnValue) == 0x000200, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::CallFunc_GetEquipped_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, CallFunc_GetFiringModeIndex_ReturnValue) == 0x000208, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::CallFunc_GetFiringModeIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, K2Node_DynamicCast_AsGBFirearm) == 0x000210, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::K2Node_DynamicCast_AsGBFirearm' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, K2Node_DynamicCast_bSuccess_1) == 0x000218, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, CallFunc_GetFiringModes_ReturnValue) == 0x000220, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::CallFunc_GetFiringModes_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, CallFunc_Array_Length_ReturnValue) == 0x000230, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, CallFunc_Subtract_IntInt_ReturnValue) == 0x000234, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, CallFunc_ChangeFiringModeIndex_ReturnValue) == 0x000238, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::CallFunc_ChangeFiringModeIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, CallFunc_Conv_IntToByte_ReturnValue) == 0x000239, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, CallFunc_Less_ByteByte_ReturnValue) == 0x00023A, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::CallFunc_Less_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, K2Node_Select_Default) == 0x00023C, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000248, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, K2Node_Event_bWasCancelled) == 0x000250, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, CallFunc_IsValid_ReturnValue_3) == 0x000251, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000258, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, CallFunc_WaitGameplayEventToActor_ReturnValue) == 0x000260, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::CallFunc_WaitGameplayEventToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, K2Node_CreateDelegate_OutputDelegate_4) == 0x000268, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master, CallFunc_IsValid_ReturnValue_4) == 0x000278, "Member 'GA_FireSelect_Master_C_ExecuteUbergraph_GA_FireSelect_Master::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");

// Function GA_FireSelect_Master.GA_FireSelect_Master_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_FireSelect_Master_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_FireSelect_Master_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_FireSelect_Master_C_K2_OnEndAbility");
static_assert(sizeof(GA_FireSelect_Master_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_FireSelect_Master_C_K2_OnEndAbility");
static_assert(offsetof(GA_FireSelect_Master_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_FireSelect_Master_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_FireSelect_Master.GA_FireSelect_Master_C.EventReceived_282D57BC1C5848FE95B8E673838E0850
// 0x00B0 (0x00B0 - 0x0000)
struct GA_FireSelect_Master_C_EventReceived_282D57BC1C5848FE95B8E673838E0850 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_FireSelect_Master_C_EventReceived_282D57BC1C5848FE95B8E673838E0850) == 0x000008, "Wrong alignment on GA_FireSelect_Master_C_EventReceived_282D57BC1C5848FE95B8E673838E0850");
static_assert(sizeof(GA_FireSelect_Master_C_EventReceived_282D57BC1C5848FE95B8E673838E0850) == 0x0000B0, "Wrong size on GA_FireSelect_Master_C_EventReceived_282D57BC1C5848FE95B8E673838E0850");
static_assert(offsetof(GA_FireSelect_Master_C_EventReceived_282D57BC1C5848FE95B8E673838E0850, Payload) == 0x000000, "Member 'GA_FireSelect_Master_C_EventReceived_282D57BC1C5848FE95B8E673838E0850::Payload' has a wrong offset!");

}

