#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HandSignal_Master

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_HandSignal_Master.GA_HandSignal_Master_C.ExecuteUbergraph_GA_HandSignal_Master
// 0x0490 (0x0490 - 0x0000)
struct GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x0038(0x00B0)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_3; // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00F8(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_4; // 0x01B4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x01C8(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable_1;                            // 0x0278(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0338(0x00B0)(ConstParm)
	class AGBCharacter*                           CallFunc_GetCharacter_ReturnValue;                 // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerControlled_ReturnValue;           // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_401[0x3];                                      // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0404(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0418(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue_1;              // 0x0428(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0438(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0448(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlledPlayer_ReturnValue;    // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0470(0x0010)(ConstParm, ReferenceParm)
	class ABP_HUD_C*                              K2Node_DynamicCast_AsBP_HUD;                       // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0489(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master) == 0x000008, "Wrong alignment on GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master");
static_assert(sizeof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master) == 0x000490, "Wrong size on GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, EntryPoint) == 0x000000, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, K2Node_CustomEvent_Payload_1) == 0x000038, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000E8, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, Temp_struct_Variable) == 0x0000F8, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, CallFunc_WaitGameplayEvent_ReturnValue) == 0x0001A8, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, CallFunc_IsValid_ReturnValue) == 0x0001B0, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001B4, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, K2Node_CustomEvent_Payload) == 0x0001C8, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, Temp_struct_Variable_1) == 0x000278, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x000328, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, CallFunc_IsValid_ReturnValue_1) == 0x000330, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, K2Node_Event_EventData) == 0x000338, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, CallFunc_GetCharacter_ReturnValue) == 0x0003E8, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, CallFunc_IsPlayerControlled_ReturnValue) == 0x0003F0, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::CallFunc_IsPlayerControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x0003F8, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, CallFunc_IsValid_ReturnValue_2) == 0x000400, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, K2Node_CreateDelegate_OutputDelegate_5) == 0x000404, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, CallFunc_GetObjectName_ReturnValue) == 0x000418, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, CallFunc_GetObjectName_ReturnValue_1) == 0x000428, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::CallFunc_GetObjectName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, CallFunc_Concat_StrStr_ReturnValue) == 0x000438, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000448, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, CallFunc_IsLocallyControlledPlayer_ReturnValue) == 0x000458, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::CallFunc_IsLocallyControlledPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, CallFunc_GetPlayerController_ReturnValue) == 0x000460, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, CallFunc_GetHUD_ReturnValue) == 0x000468, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, K2Node_MakeArray_Array) == 0x000470, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, K2Node_DynamicCast_AsBP_HUD) == 0x000480, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::K2Node_DynamicCast_AsBP_HUD' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, K2Node_DynamicCast_bSuccess) == 0x000488, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master, CallFunc_IsValid_ReturnValue_3) == 0x000489, "Member 'GA_HandSignal_Master_C_ExecuteUbergraph_GA_HandSignal_Master::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function GA_HandSignal_Master.GA_HandSignal_Master_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_HandSignal_Master_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_HandSignal_Master_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_HandSignal_Master_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_HandSignal_Master_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_HandSignal_Master_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_HandSignal_Master_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_HandSignal_Master_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_HandSignal_Master.GA_HandSignal_Master_C.EventReceived_73D21BAD067147E1A5C50BAF867829CE
// 0x00B0 (0x00B0 - 0x0000)
struct GA_HandSignal_Master_C_EventReceived_73D21BAD067147E1A5C50BAF867829CE final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_HandSignal_Master_C_EventReceived_73D21BAD067147E1A5C50BAF867829CE) == 0x000008, "Wrong alignment on GA_HandSignal_Master_C_EventReceived_73D21BAD067147E1A5C50BAF867829CE");
static_assert(sizeof(GA_HandSignal_Master_C_EventReceived_73D21BAD067147E1A5C50BAF867829CE) == 0x0000B0, "Wrong size on GA_HandSignal_Master_C_EventReceived_73D21BAD067147E1A5C50BAF867829CE");
static_assert(offsetof(GA_HandSignal_Master_C_EventReceived_73D21BAD067147E1A5C50BAF867829CE, Payload) == 0x000000, "Member 'GA_HandSignal_Master_C_EventReceived_73D21BAD067147E1A5C50BAF867829CE::Payload' has a wrong offset!");

// Function GA_HandSignal_Master.GA_HandSignal_Master_C.EventReceived_96F3887E28054F1B9CD42EE822728198
// 0x00B0 (0x00B0 - 0x0000)
struct GA_HandSignal_Master_C_EventReceived_96F3887E28054F1B9CD42EE822728198 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_HandSignal_Master_C_EventReceived_96F3887E28054F1B9CD42EE822728198) == 0x000008, "Wrong alignment on GA_HandSignal_Master_C_EventReceived_96F3887E28054F1B9CD42EE822728198");
static_assert(sizeof(GA_HandSignal_Master_C_EventReceived_96F3887E28054F1B9CD42EE822728198) == 0x0000B0, "Wrong size on GA_HandSignal_Master_C_EventReceived_96F3887E28054F1B9CD42EE822728198");
static_assert(offsetof(GA_HandSignal_Master_C_EventReceived_96F3887E28054F1B9CD42EE822728198, Payload) == 0x000000, "Member 'GA_HandSignal_Master_C_EventReceived_96F3887E28054F1B9CD42EE822728198::Payload' has a wrong offset!");

}

