#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_WristWatch_Input

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_WristWatch_Input.GA_WristWatch_Input_C.ExecuteUbergraph_GA_WristWatch_Input
// 0x00B0 (0x00B0 - 0x0000)
struct GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGBCharacter*                           CallFunc_GetCharacter_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeWaited;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitInputPress*            CallFunc_WaitInputPress_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float TimeHeld)>               K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_CustomEvent_TimeHeld;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitInputRelease*          CallFunc_WaitInputRelease_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0064(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x006C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x0074(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float TimeWaited)>             K2Node_CreateDelegate_OutputDelegate_1;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDoubleClickTime_ReturnValue;           // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_2;       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDoubleClickTime_ReturnValue_1;         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input) == 0x000008, "Wrong alignment on GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input");
static_assert(sizeof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input) == 0x0000B0, "Wrong size on GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, EntryPoint) == 0x000000, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, CallFunc_GetCharacter_ReturnValue) == 0x000008, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, K2Node_CustomEvent_TimeWaited) == 0x000010, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::K2Node_CustomEvent_TimeWaited' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000018, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000028, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, Temp_float_Variable) == 0x00002C, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, CallFunc_WaitInputPress_ReturnValue) == 0x000030, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::CallFunc_WaitInputPress_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, K2Node_CustomEvent_TimeHeld) == 0x00004C, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::K2Node_CustomEvent_TimeHeld' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, Temp_float_Variable_1) == 0x000050, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, CallFunc_WaitInputRelease_ReturnValue) == 0x000058, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::CallFunc_WaitInputRelease_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, Temp_bool_Variable) == 0x000061, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, Temp_struct_Variable) == 0x000064, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, Temp_struct_Variable_1) == 0x00006C, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, K2Node_Select_Default) == 0x000074, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, K2Node_CreateDelegate_OutputDelegate_1) == 0x00007C, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00008C, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x000090, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, CallFunc_GetDoubleClickTime_ReturnValue) == 0x000094, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::CallFunc_GetDoubleClickTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, CallFunc_GetGameTimeInSeconds_ReturnValue_2) == 0x000098, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::CallFunc_GetGameTimeInSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00009C, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, CallFunc_GetDoubleClickTime_ReturnValue_1) == 0x0000A0, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::CallFunc_GetDoubleClickTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000A4, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0000A8, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x0000AC, "Member 'GA_WristWatch_Input_C_ExecuteUbergraph_GA_WristWatch_Input::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function GA_WristWatch_Input.GA_WristWatch_Input_C.OnRelease_EC322D838035465FBAB2BD21352626B6
// 0x0004 (0x0004 - 0x0000)
struct GA_WristWatch_Input_C_OnRelease_EC322D838035465FBAB2BD21352626B6 final
{
public:
	float                                         TimeHeld;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_WristWatch_Input_C_OnRelease_EC322D838035465FBAB2BD21352626B6) == 0x000004, "Wrong alignment on GA_WristWatch_Input_C_OnRelease_EC322D838035465FBAB2BD21352626B6");
static_assert(sizeof(GA_WristWatch_Input_C_OnRelease_EC322D838035465FBAB2BD21352626B6) == 0x000004, "Wrong size on GA_WristWatch_Input_C_OnRelease_EC322D838035465FBAB2BD21352626B6");
static_assert(offsetof(GA_WristWatch_Input_C_OnRelease_EC322D838035465FBAB2BD21352626B6, TimeHeld) == 0x000000, "Member 'GA_WristWatch_Input_C_OnRelease_EC322D838035465FBAB2BD21352626B6::TimeHeld' has a wrong offset!");

// Function GA_WristWatch_Input.GA_WristWatch_Input_C.OnPress_C8BFD5C076FF45FDB1430A907F2D3F3D
// 0x0004 (0x0004 - 0x0000)
struct GA_WristWatch_Input_C_OnPress_C8BFD5C076FF45FDB1430A907F2D3F3D final
{
public:
	float                                         TimeWaited;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_WristWatch_Input_C_OnPress_C8BFD5C076FF45FDB1430A907F2D3F3D) == 0x000004, "Wrong alignment on GA_WristWatch_Input_C_OnPress_C8BFD5C076FF45FDB1430A907F2D3F3D");
static_assert(sizeof(GA_WristWatch_Input_C_OnPress_C8BFD5C076FF45FDB1430A907F2D3F3D) == 0x000004, "Wrong size on GA_WristWatch_Input_C_OnPress_C8BFD5C076FF45FDB1430A907F2D3F3D");
static_assert(offsetof(GA_WristWatch_Input_C_OnPress_C8BFD5C076FF45FDB1430A907F2D3F3D, TimeWaited) == 0x000000, "Member 'GA_WristWatch_Input_C_OnPress_C8BFD5C076FF45FDB1430A907F2D3F3D::TimeWaited' has a wrong offset!");

}

