#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_WristWatch_Check

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GroundBranch_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_WristWatch_Check.GA_WristWatch_Check_C
// 0x0038 (0x03F0 - 0x03B8)
class UGA_WristWatch_Check_C final : public UGBGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           FallbackMontage;                                   // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           FallbackMontageProne;                              // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InSection;                                         // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   OutSection;                                        // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   WatchCheckMontageName;                             // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   WatchCheckProneMontageName;                        // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_WristWatch_Check(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void OnCompleted_7781330DAEAE494AA6CB59CBCA28FB08();
	void OnBlendOut_7781330DAEAE494AA6CB59CBCA28FB08();
	void OnInterrupted_7781330DAEAE494AA6CB59CBCA28FB08();
	void OnCancelled_7781330DAEAE494AA6CB59CBCA28FB08();
	void OnCompleted_9009E98A628F40ADB4BA8D35B77E8506();
	void OnBlendOut_9009E98A628F40ADB4BA8D35B77E8506();
	void OnInterrupted_9009E98A628F40ADB4BA8D35B77E8506();
	void OnCancelled_9009E98A628F40ADB4BA8D35B77E8506();
	void EventReceived_5EFEB7409C6D437094D89ACE7ECD3606(const struct FGameplayEventData& Payload);

	void GetMontage(class UAnimMontage** OutMontage) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_WristWatch_Check_C">();
	}
	static class UGA_WristWatch_Check_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_WristWatch_Check_C>();
	}
};
static_assert(alignof(UGA_WristWatch_Check_C) == 0x000008, "Wrong alignment on UGA_WristWatch_Check_C");
static_assert(sizeof(UGA_WristWatch_Check_C) == 0x0003F0, "Wrong size on UGA_WristWatch_Check_C");
static_assert(offsetof(UGA_WristWatch_Check_C, UberGraphFrame) == 0x0003B8, "Member 'UGA_WristWatch_Check_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_WristWatch_Check_C, FallbackMontage) == 0x0003C0, "Member 'UGA_WristWatch_Check_C::FallbackMontage' has a wrong offset!");
static_assert(offsetof(UGA_WristWatch_Check_C, FallbackMontageProne) == 0x0003C8, "Member 'UGA_WristWatch_Check_C::FallbackMontageProne' has a wrong offset!");
static_assert(offsetof(UGA_WristWatch_Check_C, InSection) == 0x0003D0, "Member 'UGA_WristWatch_Check_C::InSection' has a wrong offset!");
static_assert(offsetof(UGA_WristWatch_Check_C, OutSection) == 0x0003D8, "Member 'UGA_WristWatch_Check_C::OutSection' has a wrong offset!");
static_assert(offsetof(UGA_WristWatch_Check_C, WatchCheckMontageName) == 0x0003E0, "Member 'UGA_WristWatch_Check_C::WatchCheckMontageName' has a wrong offset!");
static_assert(offsetof(UGA_WristWatch_Check_C, WatchCheckProneMontageName) == 0x0003E8, "Member 'UGA_WristWatch_Check_C::WatchCheckProneMontageName' has a wrong offset!");

}

