#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_WristWatch_Check

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_WristWatch_Check.GA_WristWatch_Check_C.ExecuteUbergraph_GA_WristWatch_Check
// 0x0318 (0x0318 - 0x0000)
struct GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0008(0x00B0)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate;  // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00C8(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0184(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0194(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x01A4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x01B4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x01C4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x01D4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x01E4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x01F4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0208(0x00B0)(ConstParm)
	class UAnimMontage*                           CallFunc_GetMontage_OutMontage;                    // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetMontage_OutMontage_1;                  // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1; // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E3[0x5];                                      // 0x02E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue; // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x02F0(0x0020)()
	bool                                          CallFunc_TryActivateAbilitiesByTag_ReturnValue;    // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check) == 0x000008, "Wrong alignment on GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check");
static_assert(sizeof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check) == 0x000318, "Wrong size on GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, EntryPoint) == 0x000000, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, K2Node_CustomEvent_Payload) == 0x000008, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, K2Node_CreateDelegate_OutputDelegate) == 0x0000B8, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, Temp_struct_Variable) == 0x0000C8, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000178, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, CallFunc_IsValid_ReturnValue) == 0x000180, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, K2Node_CreateDelegate_OutputDelegate_1) == 0x000184, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, K2Node_CreateDelegate_OutputDelegate_2) == 0x000194, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001A4, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001B4, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001C4, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001D4, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001E4, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, K2Node_CreateDelegate_OutputDelegate_8) == 0x0001F4, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, K2Node_Event_EventData) == 0x000208, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, CallFunc_GetMontage_OutMontage) == 0x0002B8, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::CallFunc_GetMontage_OutMontage' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x0002C0, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, CallFunc_GetMontage_OutMontage_1) == 0x0002C8, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::CallFunc_GetMontage_OutMontage_1' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, CallFunc_IsValid_ReturnValue_1) == 0x0002D0, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1) == 0x0002D8, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, K2Node_Event_bWasCancelled) == 0x0002E0, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, CallFunc_IsValid_ReturnValue_2) == 0x0002E1, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, CallFunc_IsLocallyControlled_ReturnValue) == 0x0002E2, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue) == 0x0002E8, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x0002F0, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check, CallFunc_TryActivateAbilitiesByTag_ReturnValue) == 0x000310, "Member 'GA_WristWatch_Check_C_ExecuteUbergraph_GA_WristWatch_Check::CallFunc_TryActivateAbilitiesByTag_ReturnValue' has a wrong offset!");

// Function GA_WristWatch_Check.GA_WristWatch_Check_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_WristWatch_Check_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_WristWatch_Check_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_WristWatch_Check_C_K2_OnEndAbility");
static_assert(sizeof(GA_WristWatch_Check_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_WristWatch_Check_C_K2_OnEndAbility");
static_assert(offsetof(GA_WristWatch_Check_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_WristWatch_Check_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_WristWatch_Check.GA_WristWatch_Check_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_WristWatch_Check_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_WristWatch_Check_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_WristWatch_Check_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_WristWatch_Check_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_WristWatch_Check_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_WristWatch_Check_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_WristWatch_Check_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_WristWatch_Check.GA_WristWatch_Check_C.EventReceived_5EFEB7409C6D437094D89ACE7ECD3606
// 0x00B0 (0x00B0 - 0x0000)
struct GA_WristWatch_Check_C_EventReceived_5EFEB7409C6D437094D89ACE7ECD3606 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_WristWatch_Check_C_EventReceived_5EFEB7409C6D437094D89ACE7ECD3606) == 0x000008, "Wrong alignment on GA_WristWatch_Check_C_EventReceived_5EFEB7409C6D437094D89ACE7ECD3606");
static_assert(sizeof(GA_WristWatch_Check_C_EventReceived_5EFEB7409C6D437094D89ACE7ECD3606) == 0x0000B0, "Wrong size on GA_WristWatch_Check_C_EventReceived_5EFEB7409C6D437094D89ACE7ECD3606");
static_assert(offsetof(GA_WristWatch_Check_C_EventReceived_5EFEB7409C6D437094D89ACE7ECD3606, Payload) == 0x000000, "Member 'GA_WristWatch_Check_C_EventReceived_5EFEB7409C6D437094D89ACE7ECD3606::Payload' has a wrong offset!");

// Function GA_WristWatch_Check.GA_WristWatch_Check_C.GetMontage
// 0x0070 (0x0070 - 0x0000)
struct GA_WristWatch_Check_C_GetMontage final
{
public:
	class UAnimMontage*                           OutMontage;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           LocalMontage;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGBCharacter*                           CallFunc_GetCharacter_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UAnimInstance>              CallFunc_GetCurrentAnimLayerClass_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsProne_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGBCharAnimInstance*                    K2Node_DynamicCast_AsGBChar_Anim_Instance;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGBCharacter*                           CallFunc_GetCharacter_ReturnValue_1;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsProne_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetMontageFromLinkedLayer_ReturnValue;    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_Select_Default_1;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_WristWatch_Check_C_GetMontage) == 0x000008, "Wrong alignment on GA_WristWatch_Check_C_GetMontage");
static_assert(sizeof(GA_WristWatch_Check_C_GetMontage) == 0x000070, "Wrong size on GA_WristWatch_Check_C_GetMontage");
static_assert(offsetof(GA_WristWatch_Check_C_GetMontage, OutMontage) == 0x000000, "Member 'GA_WristWatch_Check_C_GetMontage::OutMontage' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_GetMontage, LocalMontage) == 0x000008, "Member 'GA_WristWatch_Check_C_GetMontage::LocalMontage' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_GetMontage, Temp_bool_Variable) == 0x000010, "Member 'GA_WristWatch_Check_C_GetMontage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_GetMontage, Temp_bool_Variable_1) == 0x000011, "Member 'GA_WristWatch_Check_C_GetMontage::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_GetMontage, CallFunc_IsValid_ReturnValue) == 0x000012, "Member 'GA_WristWatch_Check_C_GetMontage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_GetMontage, CallFunc_GetCharacter_ReturnValue) == 0x000018, "Member 'GA_WristWatch_Check_C_GetMontage::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_GetMontage, CallFunc_GetCurrentAnimLayerClass_ReturnValue) == 0x000020, "Member 'GA_WristWatch_Check_C_GetMontage::CallFunc_GetCurrentAnimLayerClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_GetMontage, CallFunc_GetAnimInstance_ReturnValue) == 0x000028, "Member 'GA_WristWatch_Check_C_GetMontage::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_GetMontage, CallFunc_IsProne_ReturnValue) == 0x000030, "Member 'GA_WristWatch_Check_C_GetMontage::CallFunc_IsProne_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_GetMontage, K2Node_DynamicCast_AsGBChar_Anim_Instance) == 0x000038, "Member 'GA_WristWatch_Check_C_GetMontage::K2Node_DynamicCast_AsGBChar_Anim_Instance' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_GetMontage, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'GA_WristWatch_Check_C_GetMontage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_GetMontage, CallFunc_GetCharacter_ReturnValue_1) == 0x000048, "Member 'GA_WristWatch_Check_C_GetMontage::CallFunc_GetCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_GetMontage, K2Node_Select_Default) == 0x000050, "Member 'GA_WristWatch_Check_C_GetMontage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_GetMontage, CallFunc_IsProne_ReturnValue_1) == 0x000058, "Member 'GA_WristWatch_Check_C_GetMontage::CallFunc_IsProne_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_GetMontage, CallFunc_GetMontageFromLinkedLayer_ReturnValue) == 0x000060, "Member 'GA_WristWatch_Check_C_GetMontage::CallFunc_GetMontageFromLinkedLayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_WristWatch_Check_C_GetMontage, K2Node_Select_Default_1) == 0x000068, "Member 'GA_WristWatch_Check_C_GetMontage::K2Node_Select_Default_1' has a wrong offset!");

}

