#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Patch_CallSignWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Patch_CallSignWidget.WBP_Patch_CallSignWidget_C.SetCallSignEvent
// 0x0010 (0x0010 - 0x0000)
struct WBP_Patch_CallSignWidget_C_SetCallSignEvent final
{
public:
	class FString                                 NewCallSign;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Patch_CallSignWidget_C_SetCallSignEvent) == 0x000008, "Wrong alignment on WBP_Patch_CallSignWidget_C_SetCallSignEvent");
static_assert(sizeof(WBP_Patch_CallSignWidget_C_SetCallSignEvent) == 0x000010, "Wrong size on WBP_Patch_CallSignWidget_C_SetCallSignEvent");
static_assert(offsetof(WBP_Patch_CallSignWidget_C_SetCallSignEvent, NewCallSign) == 0x000000, "Member 'WBP_Patch_CallSignWidget_C_SetCallSignEvent::NewCallSign' has a wrong offset!");

// Function WBP_Patch_CallSignWidget.WBP_Patch_CallSignWidget_C.ExecuteUbergraph_WBP_Patch_CallSignWidget
// 0x0058 (0x0058 - 0x0000)
struct WBP_Patch_CallSignWidget_C_ExecuteUbergraph_WBP_Patch_CallSignWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_NewCallSign;                          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0030(0x0028)()
};
static_assert(alignof(WBP_Patch_CallSignWidget_C_ExecuteUbergraph_WBP_Patch_CallSignWidget) == 0x000008, "Wrong alignment on WBP_Patch_CallSignWidget_C_ExecuteUbergraph_WBP_Patch_CallSignWidget");
static_assert(sizeof(WBP_Patch_CallSignWidget_C_ExecuteUbergraph_WBP_Patch_CallSignWidget) == 0x000058, "Wrong size on WBP_Patch_CallSignWidget_C_ExecuteUbergraph_WBP_Patch_CallSignWidget");
static_assert(offsetof(WBP_Patch_CallSignWidget_C_ExecuteUbergraph_WBP_Patch_CallSignWidget, EntryPoint) == 0x000000, "Member 'WBP_Patch_CallSignWidget_C_ExecuteUbergraph_WBP_Patch_CallSignWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Patch_CallSignWidget_C_ExecuteUbergraph_WBP_Patch_CallSignWidget, K2Node_Event_NewCallSign) == 0x000008, "Member 'WBP_Patch_CallSignWidget_C_ExecuteUbergraph_WBP_Patch_CallSignWidget::K2Node_Event_NewCallSign' has a wrong offset!");
static_assert(offsetof(WBP_Patch_CallSignWidget_C_ExecuteUbergraph_WBP_Patch_CallSignWidget, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WBP_Patch_CallSignWidget_C_ExecuteUbergraph_WBP_Patch_CallSignWidget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Patch_CallSignWidget_C_ExecuteUbergraph_WBP_Patch_CallSignWidget, K2Node_MakeStruct_SlateColor) == 0x000030, "Member 'WBP_Patch_CallSignWidget_C_ExecuteUbergraph_WBP_Patch_CallSignWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");

}

