#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EditorDebug_Menu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_EditorDebug_Menu.WBP_EditorDebug_Menu_C.TraceSpawnLocationForCharacter
// 0x0240 (0x0240 - 0x0000)
struct WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_1;           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ConstParm, ReferenceParm)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x0068(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetActorEyesViewPoint_OutLocation;        // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetActorEyesViewPoint_OutRotation;        // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x00D0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15B[0x1];                                      // 0x015B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetValidatedSpawnLocation_OutValidatedSpawnLocation; // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValidatedSpawnLocation_ReturnValue;    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0xF];                                      // 0x0201(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0210(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter) == 0x000010, "Wrong alignment on WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter");
static_assert(sizeof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter) == 0x000240, "Wrong size on WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, ReturnValue) == 0x000000, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, Temp_bool_Variable) == 0x000030, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000034, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_MakeLiteralFloat_ReturnValue_1) == 0x000038, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_MakeLiteralFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_GetPlayerController_ReturnValue) == 0x000040, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, K2Node_MakeArray_Array) == 0x000048, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_K2_GetPawn_ReturnValue) == 0x000058, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_GetPlayerController_ReturnValue_1) == 0x000060, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, K2Node_MakeArray_Array_1) == 0x000068, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_GetActorEyesViewPoint_OutLocation) == 0x000078, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_GetActorEyesViewPoint_OutLocation' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_GetActorEyesViewPoint_OutRotation) == 0x000084, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_GetActorEyesViewPoint_OutRotation' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_GetForwardVector_ReturnValue) == 0x000090, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_BreakRotator_Roll) == 0x00009C, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_BreakRotator_Pitch) == 0x0000A0, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_BreakRotator_Yaw) == 0x0000A4, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000A8, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000B4, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B8, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_MakeRotator_ReturnValue) == 0x0000C4, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0000D0, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000158, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_BreakHitResult_bBlockingHit) == 0x000159, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_BreakHitResult_bInitialOverlap) == 0x00015A, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_BreakHitResult_Time) == 0x00015C, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_BreakHitResult_Distance) == 0x000160, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_BreakHitResult_Location) == 0x000164, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_BreakHitResult_ImpactPoint) == 0x000170, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_BreakHitResult_Normal) == 0x00017C, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_BreakHitResult_ImpactNormal) == 0x000188, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_BreakHitResult_PhysMat) == 0x000198, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_BreakHitResult_HitActor) == 0x0001A0, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_BreakHitResult_HitComponent) == 0x0001A8, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_BreakHitResult_HitBoneName) == 0x0001B0, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_BreakHitResult_HitItem) == 0x0001B8, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_BreakHitResult_ElementIndex) == 0x0001BC, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_BreakHitResult_FaceIndex) == 0x0001C0, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_BreakHitResult_TraceStart) == 0x0001C4, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_BreakHitResult_TraceEnd) == 0x0001D0, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, K2Node_Select_Default) == 0x0001DC, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0001E8, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_GetValidatedSpawnLocation_OutValidatedSpawnLocation) == 0x0001F4, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_GetValidatedSpawnLocation_OutValidatedSpawnLocation' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_GetValidatedSpawnLocation_ReturnValue) == 0x000200, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_GetValidatedSpawnLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter, CallFunc_MakeTransform_ReturnValue) == 0x000210, "Member 'WBP_EditorDebug_Menu_C_TraceSpawnLocationForCharacter::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

// Function WBP_EditorDebug_Menu.WBP_EditorDebug_Menu_C.AIMoveToPlayer
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_EditorDebug_Menu_C_AIMoveToPlayer final
{
public:
	class FName                                   SearchDirectionKeyName;                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SearchLocationKeyName;                             // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalGBCharacterLocation;                          // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGBCharacter*                           LocalGBCharacter;                                  // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBPlayerController*                    K2Node_DynamicCast_AsGBPlayer_Controller;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBCharacter*                           CallFunc_GetGBCharacter_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGBAIController*>                CallFunc_GetAllActorsOfClass_OutActors;            // 0x0060(0x0010)(ReferenceParm)
	class AGBAIController*                        CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue_1;              // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Normal2D_ReturnValue;              // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EditorDebug_Menu_C_AIMoveToPlayer) == 0x000008, "Wrong alignment on WBP_EditorDebug_Menu_C_AIMoveToPlayer");
static_assert(sizeof(WBP_EditorDebug_Menu_C_AIMoveToPlayer) == 0x0000C0, "Wrong size on WBP_EditorDebug_Menu_C_AIMoveToPlayer");
static_assert(offsetof(WBP_EditorDebug_Menu_C_AIMoveToPlayer, SearchDirectionKeyName) == 0x000000, "Member 'WBP_EditorDebug_Menu_C_AIMoveToPlayer::SearchDirectionKeyName' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_AIMoveToPlayer, SearchLocationKeyName) == 0x000008, "Member 'WBP_EditorDebug_Menu_C_AIMoveToPlayer::SearchLocationKeyName' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_AIMoveToPlayer, LocalGBCharacterLocation) == 0x000010, "Member 'WBP_EditorDebug_Menu_C_AIMoveToPlayer::LocalGBCharacterLocation' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_AIMoveToPlayer, LocalGBCharacter) == 0x000020, "Member 'WBP_EditorDebug_Menu_C_AIMoveToPlayer::LocalGBCharacter' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_AIMoveToPlayer, Temp_int_Array_Index_Variable) == 0x000028, "Member 'WBP_EditorDebug_Menu_C_AIMoveToPlayer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_AIMoveToPlayer, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'WBP_EditorDebug_Menu_C_AIMoveToPlayer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_AIMoveToPlayer, CallFunc_GetOwningPlayer_ReturnValue) == 0x000030, "Member 'WBP_EditorDebug_Menu_C_AIMoveToPlayer::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_AIMoveToPlayer, K2Node_DynamicCast_AsGBPlayer_Controller) == 0x000038, "Member 'WBP_EditorDebug_Menu_C_AIMoveToPlayer::K2Node_DynamicCast_AsGBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_AIMoveToPlayer, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_EditorDebug_Menu_C_AIMoveToPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_AIMoveToPlayer, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'WBP_EditorDebug_Menu_C_AIMoveToPlayer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_AIMoveToPlayer, CallFunc_GetGBCharacter_ReturnValue) == 0x000048, "Member 'WBP_EditorDebug_Menu_C_AIMoveToPlayer::CallFunc_GetGBCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_AIMoveToPlayer, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'WBP_EditorDebug_Menu_C_AIMoveToPlayer::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_AIMoveToPlayer, CallFunc_IsValid_ReturnValue) == 0x00005C, "Member 'WBP_EditorDebug_Menu_C_AIMoveToPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_AIMoveToPlayer, CallFunc_GetAllActorsOfClass_OutActors) == 0x000060, "Member 'WBP_EditorDebug_Menu_C_AIMoveToPlayer::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_AIMoveToPlayer, CallFunc_Array_Get_Item) == 0x000070, "Member 'WBP_EditorDebug_Menu_C_AIMoveToPlayer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_AIMoveToPlayer, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'WBP_EditorDebug_Menu_C_AIMoveToPlayer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_AIMoveToPlayer, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'WBP_EditorDebug_Menu_C_AIMoveToPlayer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_AIMoveToPlayer, CallFunc_GetBlackboard_ReturnValue) == 0x000080, "Member 'WBP_EditorDebug_Menu_C_AIMoveToPlayer::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_AIMoveToPlayer, CallFunc_K2_GetPawn_ReturnValue) == 0x000088, "Member 'WBP_EditorDebug_Menu_C_AIMoveToPlayer::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_AIMoveToPlayer, CallFunc_GetBlackboard_ReturnValue_1) == 0x000090, "Member 'WBP_EditorDebug_Menu_C_AIMoveToPlayer::CallFunc_GetBlackboard_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_AIMoveToPlayer, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000098, "Member 'WBP_EditorDebug_Menu_C_AIMoveToPlayer::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_AIMoveToPlayer, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000A4, "Member 'WBP_EditorDebug_Menu_C_AIMoveToPlayer::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_AIMoveToPlayer, CallFunc_Vector_Normal2D_ReturnValue) == 0x0000B0, "Member 'WBP_EditorDebug_Menu_C_AIMoveToPlayer::CallFunc_Vector_Normal2D_ReturnValue' has a wrong offset!");

// Function WBP_EditorDebug_Menu.WBP_EditorDebug_Menu_C.GetDebugFootstepText
// 0x0070 (0x0070 - 0x0000)
struct WBP_EditorDebug_Menu_C_GetDebugFootstepText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0038(0x0018)()
	bool                                          CallFunc_IsDebugDisplayOn_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0058(0x0018)()
};
static_assert(alignof(WBP_EditorDebug_Menu_C_GetDebugFootstepText) == 0x000008, "Wrong alignment on WBP_EditorDebug_Menu_C_GetDebugFootstepText");
static_assert(sizeof(WBP_EditorDebug_Menu_C_GetDebugFootstepText) == 0x000070, "Wrong size on WBP_EditorDebug_Menu_C_GetDebugFootstepText");
static_assert(offsetof(WBP_EditorDebug_Menu_C_GetDebugFootstepText, ReturnValue) == 0x000000, "Member 'WBP_EditorDebug_Menu_C_GetDebugFootstepText::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_GetDebugFootstepText, Temp_bool_Variable) == 0x000018, "Member 'WBP_EditorDebug_Menu_C_GetDebugFootstepText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_GetDebugFootstepText, Temp_text_Variable) == 0x000020, "Member 'WBP_EditorDebug_Menu_C_GetDebugFootstepText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_GetDebugFootstepText, Temp_text_Variable_1) == 0x000038, "Member 'WBP_EditorDebug_Menu_C_GetDebugFootstepText::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_GetDebugFootstepText, CallFunc_IsDebugDisplayOn_ReturnValue) == 0x000050, "Member 'WBP_EditorDebug_Menu_C_GetDebugFootstepText::CallFunc_IsDebugDisplayOn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_GetDebugFootstepText, K2Node_Select_Default) == 0x000058, "Member 'WBP_EditorDebug_Menu_C_GetDebugFootstepText::K2Node_Select_Default' has a wrong offset!");

// Function WBP_EditorDebug_Menu.WBP_EditorDebug_Menu_C.GetDebugWeaponPositionText
// 0x0070 (0x0070 - 0x0000)
struct WBP_EditorDebug_Menu_C_GetDebugWeaponPositionText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0038(0x0018)()
	bool                                          CallFunc_IsDebugDisplayOn_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0058(0x0018)()
};
static_assert(alignof(WBP_EditorDebug_Menu_C_GetDebugWeaponPositionText) == 0x000008, "Wrong alignment on WBP_EditorDebug_Menu_C_GetDebugWeaponPositionText");
static_assert(sizeof(WBP_EditorDebug_Menu_C_GetDebugWeaponPositionText) == 0x000070, "Wrong size on WBP_EditorDebug_Menu_C_GetDebugWeaponPositionText");
static_assert(offsetof(WBP_EditorDebug_Menu_C_GetDebugWeaponPositionText, ReturnValue) == 0x000000, "Member 'WBP_EditorDebug_Menu_C_GetDebugWeaponPositionText::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_GetDebugWeaponPositionText, Temp_bool_Variable) == 0x000018, "Member 'WBP_EditorDebug_Menu_C_GetDebugWeaponPositionText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_GetDebugWeaponPositionText, Temp_text_Variable) == 0x000020, "Member 'WBP_EditorDebug_Menu_C_GetDebugWeaponPositionText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_GetDebugWeaponPositionText, Temp_text_Variable_1) == 0x000038, "Member 'WBP_EditorDebug_Menu_C_GetDebugWeaponPositionText::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_GetDebugWeaponPositionText, CallFunc_IsDebugDisplayOn_ReturnValue) == 0x000050, "Member 'WBP_EditorDebug_Menu_C_GetDebugWeaponPositionText::CallFunc_IsDebugDisplayOn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_GetDebugWeaponPositionText, K2Node_Select_Default) == 0x000058, "Member 'WBP_EditorDebug_Menu_C_GetDebugWeaponPositionText::K2Node_Select_Default' has a wrong offset!");

// Function WBP_EditorDebug_Menu.WBP_EditorDebug_Menu_C.GetDebugEquippedText
// 0x0070 (0x0070 - 0x0000)
struct WBP_EditorDebug_Menu_C_GetDebugEquippedText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0038(0x0018)()
	bool                                          CallFunc_IsDebugDisplayOn_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0058(0x0018)()
};
static_assert(alignof(WBP_EditorDebug_Menu_C_GetDebugEquippedText) == 0x000008, "Wrong alignment on WBP_EditorDebug_Menu_C_GetDebugEquippedText");
static_assert(sizeof(WBP_EditorDebug_Menu_C_GetDebugEquippedText) == 0x000070, "Wrong size on WBP_EditorDebug_Menu_C_GetDebugEquippedText");
static_assert(offsetof(WBP_EditorDebug_Menu_C_GetDebugEquippedText, ReturnValue) == 0x000000, "Member 'WBP_EditorDebug_Menu_C_GetDebugEquippedText::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_GetDebugEquippedText, Temp_bool_Variable) == 0x000018, "Member 'WBP_EditorDebug_Menu_C_GetDebugEquippedText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_GetDebugEquippedText, Temp_text_Variable) == 0x000020, "Member 'WBP_EditorDebug_Menu_C_GetDebugEquippedText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_GetDebugEquippedText, Temp_text_Variable_1) == 0x000038, "Member 'WBP_EditorDebug_Menu_C_GetDebugEquippedText::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_GetDebugEquippedText, CallFunc_IsDebugDisplayOn_ReturnValue) == 0x000050, "Member 'WBP_EditorDebug_Menu_C_GetDebugEquippedText::CallFunc_IsDebugDisplayOn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_GetDebugEquippedText, K2Node_Select_Default) == 0x000058, "Member 'WBP_EditorDebug_Menu_C_GetDebugEquippedText::K2Node_Select_Default' has a wrong offset!");

// Function WBP_EditorDebug_Menu.WBP_EditorDebug_Menu_C.GetDebugBulletsText
// 0x0070 (0x0070 - 0x0000)
struct WBP_EditorDebug_Menu_C_GetDebugBulletsText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0038(0x0018)()
	bool                                          CallFunc_IsDebugDisplayOn_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0058(0x0018)()
};
static_assert(alignof(WBP_EditorDebug_Menu_C_GetDebugBulletsText) == 0x000008, "Wrong alignment on WBP_EditorDebug_Menu_C_GetDebugBulletsText");
static_assert(sizeof(WBP_EditorDebug_Menu_C_GetDebugBulletsText) == 0x000070, "Wrong size on WBP_EditorDebug_Menu_C_GetDebugBulletsText");
static_assert(offsetof(WBP_EditorDebug_Menu_C_GetDebugBulletsText, ReturnValue) == 0x000000, "Member 'WBP_EditorDebug_Menu_C_GetDebugBulletsText::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_GetDebugBulletsText, Temp_bool_Variable) == 0x000018, "Member 'WBP_EditorDebug_Menu_C_GetDebugBulletsText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_GetDebugBulletsText, Temp_text_Variable) == 0x000020, "Member 'WBP_EditorDebug_Menu_C_GetDebugBulletsText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_GetDebugBulletsText, Temp_text_Variable_1) == 0x000038, "Member 'WBP_EditorDebug_Menu_C_GetDebugBulletsText::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_GetDebugBulletsText, CallFunc_IsDebugDisplayOn_ReturnValue) == 0x000050, "Member 'WBP_EditorDebug_Menu_C_GetDebugBulletsText::CallFunc_IsDebugDisplayOn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_GetDebugBulletsText, K2Node_Select_Default) == 0x000058, "Member 'WBP_EditorDebug_Menu_C_GetDebugBulletsText::K2Node_Select_Default' has a wrong offset!");

// Function WBP_EditorDebug_Menu.WBP_EditorDebug_Menu_C.OnPreviewKeyDown
// 0x02B8 (0x02B8 - 0x0000)
struct WBP_EditorDebug_Menu_C_OnPreviewKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0128(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0140(0x00B8)()
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0200(0x00B8)()
};
static_assert(alignof(WBP_EditorDebug_Menu_C_OnPreviewKeyDown) == 0x000008, "Wrong alignment on WBP_EditorDebug_Menu_C_OnPreviewKeyDown");
static_assert(sizeof(WBP_EditorDebug_Menu_C_OnPreviewKeyDown) == 0x0002B8, "Wrong size on WBP_EditorDebug_Menu_C_OnPreviewKeyDown");
static_assert(offsetof(WBP_EditorDebug_Menu_C_OnPreviewKeyDown, MyGeometry) == 0x000000, "Member 'WBP_EditorDebug_Menu_C_OnPreviewKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_OnPreviewKeyDown, InKeyEvent) == 0x000038, "Member 'WBP_EditorDebug_Menu_C_OnPreviewKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_OnPreviewKeyDown, ReturnValue) == 0x000070, "Member 'WBP_EditorDebug_Menu_C_OnPreviewKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_OnPreviewKeyDown, CallFunc_GetKey_ReturnValue) == 0x000128, "Member 'WBP_EditorDebug_Menu_C_OnPreviewKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_OnPreviewKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000140, "Member 'WBP_EditorDebug_Menu_C_OnPreviewKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_OnPreviewKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x0001F8, "Member 'WBP_EditorDebug_Menu_C_OnPreviewKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_OnPreviewKeyDown, CallFunc_Handled_ReturnValue) == 0x000200, "Member 'WBP_EditorDebug_Menu_C_OnPreviewKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_EditorDebug_Menu.WBP_EditorDebug_Menu_C.BndEvt__WBP_ExampleMap_Menu_ComboBox_DebugPhysicalMaterial_K2Node_ComponentBoundEvent_4_OnIndexChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_EditorDebug_Menu_C_BndEvt__WBP_ExampleMap_Menu_ComboBox_DebugPhysicalMaterial_K2Node_ComponentBoundEvent_4_OnIndexChanged__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EditorDebug_Menu_C_BndEvt__WBP_ExampleMap_Menu_ComboBox_DebugPhysicalMaterial_K2Node_ComponentBoundEvent_4_OnIndexChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_EditorDebug_Menu_C_BndEvt__WBP_ExampleMap_Menu_ComboBox_DebugPhysicalMaterial_K2Node_ComponentBoundEvent_4_OnIndexChanged__DelegateSignature");
static_assert(sizeof(WBP_EditorDebug_Menu_C_BndEvt__WBP_ExampleMap_Menu_ComboBox_DebugPhysicalMaterial_K2Node_ComponentBoundEvent_4_OnIndexChanged__DelegateSignature) == 0x000004, "Wrong size on WBP_EditorDebug_Menu_C_BndEvt__WBP_ExampleMap_Menu_ComboBox_DebugPhysicalMaterial_K2Node_ComponentBoundEvent_4_OnIndexChanged__DelegateSignature");
static_assert(offsetof(WBP_EditorDebug_Menu_C_BndEvt__WBP_ExampleMap_Menu_ComboBox_DebugPhysicalMaterial_K2Node_ComponentBoundEvent_4_OnIndexChanged__DelegateSignature, Index_0) == 0x000000, "Member 'WBP_EditorDebug_Menu_C_BndEvt__WBP_ExampleMap_Menu_ComboBox_DebugPhysicalMaterial_K2Node_ComponentBoundEvent_4_OnIndexChanged__DelegateSignature::Index_0' has a wrong offset!");

// Function WBP_EditorDebug_Menu.WBP_EditorDebug_Menu_C.OnPhysicalMaterialLoaded_Event
// 0x0008 (0x0008 - 0x0000)
struct WBP_EditorDebug_Menu_C_OnPhysicalMaterialLoaded_Event final
{
public:
	class UObject*                                LoadedAsset;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EditorDebug_Menu_C_OnPhysicalMaterialLoaded_Event) == 0x000008, "Wrong alignment on WBP_EditorDebug_Menu_C_OnPhysicalMaterialLoaded_Event");
static_assert(sizeof(WBP_EditorDebug_Menu_C_OnPhysicalMaterialLoaded_Event) == 0x000008, "Wrong size on WBP_EditorDebug_Menu_C_OnPhysicalMaterialLoaded_Event");
static_assert(offsetof(WBP_EditorDebug_Menu_C_OnPhysicalMaterialLoaded_Event, LoadedAsset) == 0x000000, "Member 'WBP_EditorDebug_Menu_C_OnPhysicalMaterialLoaded_Event::LoadedAsset' has a wrong offset!");

// Function WBP_EditorDebug_Menu.WBP_EditorDebug_Menu_C.ReceiveSettingsFromPopUp
// 0x0020 (0x0020 - 0x0000)
struct WBP_EditorDebug_Menu_C_ReceiveSettingsFromPopUp final
{
public:
	class FString                                 TimeOfDaySetting;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WeatherSetting;                                    // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EditorDebug_Menu_C_ReceiveSettingsFromPopUp) == 0x000008, "Wrong alignment on WBP_EditorDebug_Menu_C_ReceiveSettingsFromPopUp");
static_assert(sizeof(WBP_EditorDebug_Menu_C_ReceiveSettingsFromPopUp) == 0x000020, "Wrong size on WBP_EditorDebug_Menu_C_ReceiveSettingsFromPopUp");
static_assert(offsetof(WBP_EditorDebug_Menu_C_ReceiveSettingsFromPopUp, TimeOfDaySetting) == 0x000000, "Member 'WBP_EditorDebug_Menu_C_ReceiveSettingsFromPopUp::TimeOfDaySetting' has a wrong offset!");
static_assert(offsetof(WBP_EditorDebug_Menu_C_ReceiveSettingsFromPopUp, WeatherSetting) == 0x000010, "Member 'WBP_EditorDebug_Menu_C_ReceiveSettingsFromPopUp::WeatherSetting' has a wrong offset!");

// Function WBP_EditorDebug_Menu.WBP_EditorDebug_Menu_C.BndEvt__WBP_EditorDebugMenu_ComboBox_GameMode_K2Node_ComponentBoundEvent_11_OnIndexChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_EditorDebug_Menu_C_BndEvt__WBP_EditorDebugMenu_ComboBox_GameMode_K2Node_ComponentBoundEvent_11_OnIndexChanged__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EditorDebug_Menu_C_BndEvt__WBP_EditorDebugMenu_ComboBox_GameMode_K2Node_ComponentBoundEvent_11_OnIndexChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_EditorDebug_Menu_C_BndEvt__WBP_EditorDebugMenu_ComboBox_GameMode_K2Node_ComponentBoundEvent_11_OnIndexChanged__DelegateSignature");
static_assert(sizeof(WBP_EditorDebug_Menu_C_BndEvt__WBP_EditorDebugMenu_ComboBox_GameMode_K2Node_ComponentBoundEvent_11_OnIndexChanged__DelegateSignature) == 0x000004, "Wrong size on WBP_EditorDebug_Menu_C_BndEvt__WBP_EditorDebugMenu_ComboBox_GameMode_K2Node_ComponentBoundEvent_11_OnIndexChanged__DelegateSignature");
static_assert(offsetof(WBP_EditorDebug_Menu_C_BndEvt__WBP_EditorDebugMenu_ComboBox_GameMode_K2Node_ComponentBoundEvent_11_OnIndexChanged__DelegateSignature, Index_0) == 0x000000, "Member 'WBP_EditorDebug_Menu_C_BndEvt__WBP_EditorDebugMenu_ComboBox_GameMode_K2Node_ComponentBoundEvent_11_OnIndexChanged__DelegateSignature::Index_0' has a wrong offset!");

// Function WBP_EditorDebug_Menu.WBP_EditorDebug_Menu_C.ExecuteUbergraph_WBP_EditorDebug_Menu
// 0x09E0 (0x09E0 - 0x0000)
struct WBP_EditorDebug_Menu_C_ExecuteUbergraph_WBP_EditorDebug_Menu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBGameMode*                            K2Node_DynamicCast_AsGBGame_Mode;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBGameMode*                            K2Node_DynamicCast_AsGBGame_Mode_1;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_2;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBGameMode*                            K2Node_DynamicCast_AsGBGame_Mode_2;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_3;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBGameMode*                            K2Node_DynamicCast_AsGBGame_Mode_3;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* LoadedAsset)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_7;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AGBPlayerController*>            CallFunc_GetAllActorsOfClass_OutActors;            // 0x00D8(0x0010)(ReferenceParm)
	class AGBPlayerController*                    CallFunc_Array_Get_Item;                           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGBCharacter*                           CallFunc_GetGBCharacter_ReturnValue;               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGBFirearm*>                     CallFunc_GetInvItemsByClass_ReturnValue;           // 0x0108(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGBPouch*>                       CallFunc_GetInvItemsByClass_ReturnValue_1;         // 0x0120(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_8;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
